# Pandas

### 구조화된 데이터의 처리를 지원하는 Python 라이브러리 => Python의 엑셀

- 구조화된 데이터의 처리를 지원하는 Python 라이브러리
- 고성능 Array 계산 라이브러리인 Numpy와 통합하여, 강력한 "스프레드시트" 처리 기능을 제공
- 인덱싱, 연상용 함수, 전처리 함수 등을 제공함

# 1. Pandas 개요

### data loading

In [1]:
import pandas as pd

In [3]:
# Data URL
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
# csv 타입 데이터 로드, separate는 빈 공간으로 지정하고, Column은 없음
df_data = pd.read_csv(data_url, sep='\s+', header = None)

In [4]:
# 처음 다섯 줄 출력
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

## Pandas의 구성

- Series : DataFrame 중 하나의 Column에 해당하는 데이터의 모음 Object
- DataFrame : Data Table 전체를 포함하는 Object

In [12]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
example_obj = Series()

In [4]:
list_data = [1,2,3,4,5]
example_obj = Series(data = list_data)
print(example_obj)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
list_data = [1,2,3,4,5]
list_name = ["a", "b", "c", "d", "e"]
example_obj = Series(data = list_data, index=list_name)
print(example_obj)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
dict_data = {"a":1, "b":2, "c":3, "d":4, "e":5}
example_obj = Series(data = dict_data, dtype=np.float32, name = "example_data")
print(example_obj)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [14]:
example_obj["a"]

1.0

In [15]:
example_obj["a"] = 3.2
print(example_obj)

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [16]:
print(example_obj.values)
print(type(example_obj.values))

[3.2 2.  3.  4.  5. ]
<class 'numpy.ndarray'>

In [17]:
print(example_obj.index)
print(type(example_obj.index))

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
<class 'pandas.indexes.base.Index'>

In [18]:
example_obj.name = "number"
example_obj.index.name = "alphabet"
print(example_obj)

alphabet
a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

In [23]:
dict_data_1 = {"a":1, "b":2, "c":3, "d":4, "e":5}
indexes = ["a", "b", "c", "d", "e", "f", "g", "h"]
series_obj_1 = Series(data = dict_data_1, index = indexes)
print(series_obj_1)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    NaN
g    NaN
h    NaN
dtype: float64

In [25]:
# boolean operation
example_obj[example_obj > 2]

alphabet
a    3.2
c    3.0
d    4.0
e    5.0
Name: number, dtype: float32

In [26]:
example_obj * 2

alphabet
a     6.4
b     4.0
c     6.0
d     8.0
e    10.0
Name: number, dtype: float32

### Series 연산

In [82]:
s1 = Series(range(1, 6), index = list("abcde"))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [84]:
s2 = Series(range(5, 11), index = list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int32

Series는 + 연산을 통하여 같은 index에 해당하는 숫자들은 + 연산을 하지만 한 쪽에만 index가 존재하는 값은 NaN을 반환합니다.

In [85]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

+연산과 동일한 작업을 add 함수로 할 수 있고, 추가적인 명령도 할 수 있습니다.

In [86]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f     NaN
dtype: float64

In [87]:
s1.add(s2, fill_value= 0)

a     1.0
b     7.0
c     9.0
d    12.0
e    12.0
e    14.0
f    10.0
dtype: float64

# 3. DataFrame

앞에서 설명한 바와 같이 Pandas의 Series = Numpy + index 라고 설명하였습니다. <br>
각 Numpy는 한 개의 data type을 가질 수 있습니다. 예를 들어 Numpy a의 dtype = np.float32, Numpy b의 dtype = str ... 과 같이 한 개의 Numpy 객체는 오직 한 개의 dtype을 가질 수 있어서 한 개의 Numpy 객체에 숫자와 문자를 같이 저장할 수 없습니다.

Series = Numpy + index 이므로 한 개의 Series에는 한 개의 dtype만 저장할 수 있습니다. DataFrame 관점에서는 여러개의 Series가 모여서 형성되므로 다양한 형태의 dtype을 가지는 Series로 구성된 DataFrame이 될 수 있습니다. 

### 아래는 column 기준의 Series 데이터를 읽는 방법에 대한 설명 입니다.

In [2]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [7]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

df = DataFrame(data = raw_data)
df

   age           city first_name last_name
0   42  San Francisco      Jason    Miller
1   52      Baltimore      Molly  Jacobson
2   36          Miami       Tina       Ali
3   24        Douglas       Jake    Milner
4   73         Boston        Amy     Cooze

Column의 일부만 가져오면 해당 Column의 Series만 가져오게 됩니다.

In [8]:
DataFrame(data = raw_data, columns=['first_name', 'age'])

  first_name  age
0      Jason   42
1      Molly   52
2       Tina   36
3       Jake   24
4        Amy   73

기존 data에 없는 column을 가져오면 Series를 일단 생성하고 NaN 값을 채워 넣습니다.

In [9]:
DataFrame(data = raw_data, columns = ['first_name', 'last_name', 'age', 'salary'])

  first_name last_name  age salary
0      Jason    Miller   42    NaN
1      Molly  Jacobson   52    NaN
2       Tina       Ali   36    NaN
3       Jake    Milner   24    NaN
4        Amy     Cooze   73    NaN

In [11]:
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [12]:
df["first_name"]

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

### 행 기준으로 데이터를 추출하는 방법

In [13]:
df.loc[1]

age                  52
city          Baltimore
first_name        Molly
last_name      Jacobson
Name: 1, dtype: object

In [14]:
df.iloc[1]

age                  52
city          Baltimore
first_name        Molly
last_name      Jacobson
Name: 1, dtype: object

In [15]:
df["age"][1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

## loc vs. iloc
- loc : index의 이름 기준
- iloc : index number 기준

In [17]:
s = Series(data = np.nan, index = [10, 11, 12, 13, 14, 1, 2, 3, 4, 5])
s.loc[3:]

3   NaN
4   NaN
5   NaN
dtype: float64

In [18]:
s.iloc[3:]

13   NaN
14   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

### DataFrame에서 행/열 가져오는 방법

- 행 : df.iloc/loc 
- 열 : df["열 이름"], df.열 이름

### Column에 새로운 값 할당하기

In [32]:
df["debt"] = np.nan
df

   age           city first_name last_name  debt
0   42  San Francisco      Jason    Miller   NaN
1   52      Baltimore      Molly  Jacobson   NaN
2   36          Miami       Tina       Ali   NaN
3   24        Douglas       Jake    Milner   NaN
4   73         Boston        Amy     Cooze   NaN

Numpy의 Boolean Operation을 이용하여 Column을 생성할 수 있다. 이것 또한 Series가 Numpy로 만들어 졌기 때문에 가능합니다.

In [34]:
df.debt = df.age > 40
df

   age           city first_name last_name   debt
0   42  San Francisco      Jason    Miller   True
1   52      Baltimore      Molly  Jacobson   True
2   36          Miami       Tina       Ali  False
3   24        Douglas       Jake    Milner  False
4   73         Boston        Amy     Cooze   True

In [37]:
# 행/열 전치
df.T

                        0          1      2        3       4
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
debt                 True       True  False    False    True

In [38]:
# DataFrame → Numpy
df.values

array([[42, 'San Francisco', 'Jason', 'Miller', True],
       [52, 'Baltimore', 'Molly', 'Jacobson', True],
       [36, 'Miami', 'Tina', 'Ali', False],
       [24, 'Douglas', 'Jake', 'Milner', False],
       [73, 'Boston', 'Amy', 'Cooze', True]], dtype=object)

### 특정 Column 삭제

In [40]:
del df["debt"]
df

   age           city first_name last_name
0   42  San Francisco      Jason    Miller
1   52      Baltimore      Molly  Jacobson
2   36          Miami       Tina       Ali
3   24        Douglas       Jake    Milner
4   73         Boston        Amy     Cooze

### Nested Dict를 사용하면 행/열 각각 index name을 사용할 수 있다.
물론 이렇게 Pandas에서 직접 입력할 일을 거의 없다

In [41]:
data = {'Nevada': {2001: 2.4, 2002: 2.9},
 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

DataFrame(data)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

### 특정 Series 추가하기

In [42]:
values = Series(data = ["M", "F", "M"], index = [0, 1, 3])
df["sex"] = values
df

   age           city first_name last_name  sex
0   42  San Francisco      Jason    Miller    M
1   52      Baltimore      Molly  Jacobson    F
2   36          Miami       Tina       Ali  NaN
3   24        Douglas       Jake    Milner    M
4   73         Boston        Amy     Cooze  NaN

### DataFrame 연산

In [88]:
df1 = DataFrame(data = np.arange(9).reshape(3,3), index = list("abc"))
df1

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8

In [89]:
df2 = DataFrame(data = np.arange(16).reshape(4,4), index = list("abcd"))
df2

    0   1   2   3
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [90]:
df1 + df2

      0     1     2   3
a   0.0   2.0   4.0 NaN
b   7.0   9.0  11.0 NaN
c  14.0  16.0  18.0 NaN
d   NaN   NaN   NaN NaN

In [91]:
df1.add(df2, fill_value=0)

      0     1     2     3
a   0.0   2.0   4.0   3.0
b   7.0   9.0  11.0   7.0
c  14.0  16.0  18.0  11.0
d  12.0  13.0  14.0  15.0

In [99]:
df = DataFrame(np.arange(16).reshape(4,4), columns = list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [100]:
s = Series(np.arange(10, 14), index = list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int32

In [101]:
df.add(s)

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [102]:
df = DataFrame(np.arange(16).reshape(4,4), columns = list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [103]:
s2 = Series(np.arange(10, 14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [104]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [110]:
df.add(s2, axis = 0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

# 4. Selection

엑셀 데이터 로딩 시 <br>
cmd에서 conda install --y xlrd 하여 xlrd 모듈을 설치한다. <br>
Jupyter Notebook 에서는 !conda install --y xlrd 을 치면 바로 설치 가능함

In [56]:
import pandas as pd
import numpy as np

df = pd.read_excel("data/excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

index number 또는 column name을 이용하여 data를 선택할 수 있습니다.
엑셀 데이터를 바로 읽어 왔을 때 첫 열은 row의 index를 나타내는 데 실제 데이터에 있는 값은 아니고 자동적으로 row의 번호가 생성되게 됩니다.

In [57]:
df["account"].head(2)

0    211829
1    320563
Name: account, dtype: int64

In [58]:
df[["account", "street", "state"]].head(3)

   account                                street          state
0   211829                    34456 Sean Highway          Texas
1   320563                     1311 Alvis Tunnel  NorthCarolina
2   648336  62184 Schamberger Underpass Apt. 231           Iowa

Column 이름 없이 사용하는 index number는 <span class="mark">row 기준</span> 표시

In [59]:
df[:3]

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000

column 이름과 함께 row, index 사용 시 해당 column만 가져오게 됩니다.
사용 할 때, Series를 먼저 가져오고 해당 Series에서 필요한 row를 가져온다고 생각하면 됩니다.

In [60]:
df["account"][:3]

0    211829
1    320563
2    648336
Name: account, dtype: int64

다음은 필요한 Series를 list에서 먼저 가져오고, 그 다음 필요한 row를 가져와보도록 하겠습니다.

In [61]:
df[[0,1,2]][2:5]

   account                         name                                street
2   648336   Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231
3   109996  D'Amore, Gleichner and Bode           155 Fadel Crescent Apt. 144
4   121213                Bauch-Goldner                   7274 Marissa Common

In [62]:
account_series = df["account"]
account_series[account_series < 250000]

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

df.index를 접근하면 index 값을 변경할 수 있습니다.

In [63]:
df.index = range(5, 20)
df

,account,name,street,city,state,postal-code,Jan,Feb,Mar
5,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
6,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
7,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
8,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
9,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
10,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
11,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
12,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
13,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
14,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
15,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
16,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
17,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
18,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
19,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [64]:
# 원상 복구
df.index = range(0, 15)
df.head(15)

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

# 5. Drop

df.drop()을 이용하여 행/열을 삭제할 수 있습니다.
row 넘버를 이용하여 drop

In [70]:
df.drop(1)

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

row 넘버의 list로 drop

In [66]:
df.drop([1, 3])

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,132971,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,145068,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,205217,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,209744,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,212303,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,214098,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,231907,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,242368,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,268755,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,273274,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

열을 기준으로 제거하고 싶으면 열의 이름과 axis = 1을 적용한다. axis = 1을 써야한다는게 와닿지는 않지만...

In [72]:
df.drop("account", axis = 1)

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,Gerhold-Maggio,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,"Goodwin, Homenick and Jerde",649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,Hahn-Moore,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,"Frami, Anderson and Donnelly",182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,Walsh-Haley,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,McDermott PLC,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

In [73]:
df.drop(["account", "name"], axis = 1)

,street,city,state,postal-code,Jan,Feb,Mar
0,34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000
9,366 Maggio Grove Apt. 998,North Ras,Idaho,46308,70000,120000,35000
10,649 Cierra Forks Apt. 078,Rosaberg,Tenessee,47743,45000,120000,55000
11,18115 Olivine Throughway,Norbertomouth,NorthDakota,31415,150000,10000,162000
12,182 Bertie Road,East Davian,Iowa,72686,162000,120000,35000
13,2624 Beatty Parkways,Goodwinmouth,RhodeIsland,31919,55000,120000,35000
14,8917 Bergstrom Meadow,Kathryneborough,Delaware,27933,150000,120000,70000

# 6. lambda, map, apply

## lambda 함수
lambda 함수는 한 줄로 함수를 표현하는 익명 함수 기법

    lambda argument : expression
    
ex) labmda x, y : x + y

In [1]:
def f1(x, y):
    return x + y

f2 = lambda x,y : x + y

print(f1(1,2))
print(f2(1,2))

3
3

이름을 할당하지 않는 lambda 함수도 성립 가능

In [2]:
(lambda x:x+1)(5)

6

## map 함수

- 함수와 sequence 형 데이터를 인자로 받아
- 각 element 마다 입력 받은 함수를 적용하여 list로 반환
- 일반적으로 함수를 lambda 형태로 표현함

    map(function, sequence)

In [3]:
ex = [1,2,3,4,5]
f = lambda x:x**2
list(map(f, ex))

[1, 4, 9, 16, 25]

두 개 이상의 argument가 있을 때는 두 개의 sequence 형을 써야 함

In [25]:
f = lambda x, y:x + y
list(map(f, ex, ex))

[2, 4, 6, 8, 10]

## map for series

- Pandas의 series type의 데이터에도 map 함수 사용 가능
- function 대신 dict, sequence형 자료등으로 대체 가능

In [26]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [27]:
s1.map(lambda x:x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

dict type으로 데이터 교체, 없는 값은 NaN

In [28]:
z = {1:'A', 2:'B', 3:'C'}
s1.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

같은 위치의 데이터를 s2로 전환

In [29]:
s2 = Series(np.arange(10, 20))
s1.map(s2).head(5)

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [30]:
df = pd.read_excel("data/wages.xlsx")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

성별에서 중복되지 않은 값들의 리스트를 구해 본다.

In [31]:
df.sex.unique()

array(['male', 'female'], dtype=object)

male => 0, female => 1로 변형

In [34]:
df["sex_code"] = df.sex.map({"male":0, "female":1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

### Replace function

- Map 함수의 기능 중 데이터 변환 기능만 담당
- 데이터 변환 시 많이 사용하는 함수

In [35]:
df.sex.replace({"male":0, "female":1}).head()

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

replace 함수 시 아래와 같이 list 형태로 짝을 맞추어도 가능하고, inplace = True를 적용하면

In [36]:
df.sex.replace(["male", "female"], [0, 1], inplace=True)
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

## apply for dataframe

- map과 달리, Series 전체(column)에 해당 함수를 적용
- 입력값이 series 데이터로 입력 받아 handling 가능

In [37]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [38]:
f = lambda x: x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

lambda 형태 이외의 function 형태로도 적용 가능

In [39]:
def f(x):
    return Series([x.min(), x.max()], index = ["min", "max"])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

## applymap for dataframe

- series 단위가 아닌 dataframe 전체에 함수를 적용
- series 단위에 apply를 적용시킬 때와 같은 효과

In [40]:
f = lambda x : -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [41]:
f = lambda x : -x
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

# 7. Pandas Built-in Function

## describe
Numeric type 데이터의 요약 정보를 보여줌

In [28]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

df = pd.read_excel("data/wages.xlsx")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [29]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

## Unique

- Series data의 유일한 값을 list를 반환함

In [30]:
df["race"].unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [31]:
key = df["race"].unique()
value = np.arange(len(key))

In [32]:
df["race"].replace(to_replace =key, value = value, inplace = True)

In [33]:
df.head(5)

           earn  height     sex  race  ed  age
0  79571.299011   73.89    male     0  16   49
1  96396.988643   66.23  female     0  16   62
2  48710.666947   63.77  female     0  16   33
3  80478.096153   63.22  female     1  16   95
4  82089.345498   63.08  female     0  17   43

## Sum

- 기본적인 column 또는 row 값의 연산을 지원
- sub, mean, min, max, count, median, var 등

In [34]:
df.sum(axis = 0) # Column 별

earn                                            4.47434e+07
height                                              91831.3
sex       malefemalefemalefemalefemalefemalefemalemalema...
race                                                    561
ed                                                    18416
age                                                   62508
dtype: object

In [35]:
df.sum(axis = 1) # row 별

0        79710.189011
1        96541.218643
2        48823.436947
3        80653.316153
4        82212.425498
5        15422.882901
6        47230.711821
7        51100.344282
8         3326.889556
9        43111.037884
10       10483.838843
11        1133.457155
12       47714.929864
13       19130.622299
14       20195.856639
15        1095.892346
16       36093.181123
17       27072.613964
18       64717.223972
19       70124.713070
20        1101.298306
21       12270.022115
22       84351.157919
23        9079.644935
24       23380.363278
25        8856.809185
26       64716.549805
27       54212.504945
28       17012.860044
29           8.749721
            ...
1349     64752.641872
1350     16059.423155
1351     25480.928379
1352     18610.227184
1353     26560.776457
1354     28757.820098
1355     20174.062736
1356      6466.932127
1357     95549.526798
1358     68564.843058
1359     50418.021292
1360     80646.389376
1361     44035.074343
1362     47859.290935
1363     19296.867431
1364      1115.275131
1365     32911.421176
1366     25004.493294
1367     40880.105077
1368      4323.412685
1369      4869.676508
1370    176038.353598
1371     87635.788778
1372     92350.216106
1373     17031.637851
1374     30290.060363
1375     25018.829514
1376     13823.311312
1377     95563.664410
1378      9686.681857
dtype: float64

## isnull

- column 또는 row 값의 NaN(null) 값의 index를 반환함

In [36]:
df.isnull()

       earn height    sex   race     ed    age
0     False  False  False  False  False  False
1     False  False  False  False  False  False
2     False  False  False  False  False  False
3     False  False  False  False  False  False
4     False  False  False  False  False  False
5     False  False  False  False  False  False
6     False  False  False  False  False  False
7     False  False  False  False  False  False
8     False  False  False  False  False  False
9     False  False  False  False  False  False
10    False  False  False  False  False  False
11    False  False  False  False  False  False
12    False  False  False  False  False  False
13    False  False  False  False  False  False
14    False  False  False  False  False  False
15    False  False  False  False  False  False
16    False  False  False  False  False  False
17    False  False  False  False  False  False
18    False  False  False  False  False  False
19    False  False  False  False  False  False
20    False  False  False  False  False  False
21    False  False  False  False  False  False
22    False  False  False  False  False  False
23    False  False  False  False  False  False
24    False  False  False  False  False  False
25    False  False  False  False  False  False
26    False  False  False  False  False  False
27    False  False  False  False  False  False
28    False  False  False  False  False  False
29    False  False  False  False  False  False
...     ...    ...    ...    ...    ...    ...
1349  False  False  False  False  False  False
1350  False  False  False  False  False  False
1351  False  False  False  False  False  False
1352  False  False  False  False  False  False
1353  False  False  False  False  False  False
1354  False  False  False  False  False  False
1355  False  False  False  False  False  False
1356  False  False  False  False  False  False
1357  False  False  False  False  False  False
1358  False  False  False  False  False  False
1359  False  False  False  False  False  False
1360  False  False  False  False  False  False
1361  False  False  False  False  False  False
1362  False  False  False  False  False  False
1363  False  False  False  False  False  False
1364  False  False  False  False  False  False
1365  False  False  False  False  False  False
1366  False  False  False  False  False  False
1367  False  False  False  False  False  False
1368  False  False  False  False  False  False
1369  False  False  False  False  False  False
1370  False  False  False  False  False  False
1371  False  False  False  False  False  False
1372  False  False  False  False  False  False
1373  False  False  False  False  False  False
1374  False  False  False  False  False  False
1375  False  False  False  False  False  False
1376  False  False  False  False  False  False
1377  False  False  False  False  False  False
1378  False  False  False  False  False  False

[1379 rows x 6 columns]

In [37]:
# Null인 값의 합
df.isnull().sum()

earn      0
height    0
sex       0
race      0
ed        0
age       0
dtype: int64

## sort_values
- column 값을 기준으로 데이터를 sorting
- list의 column 값 순서대로 정렬

In [38]:
df.sort_values("age", ascending=True).head(10)

              earn  height     sex  race  ed  age
562    4831.589257   71.34    male     3  11   22
522    1955.168187   69.87  female     3  12   22
1301   4159.033222   61.54  female     0  13   22
1105    988.565070   64.71  female     0  12   22
1112   4160.531055   67.87  female     0  12   22
933    1007.994941   68.26  female     0  12   22
1113  16890.617263   62.86  female     0  12   22
1121   3163.022911   66.30    male     0  12   22
862    1002.023843   66.59  female     0  12   22
963     -25.655260   68.90    male     0  12   22

In [39]:
df.sort_values(["age", "earn"], ascending= True).head(10)

             earn  height     sex  race  ed  age
1038   -56.321979   67.81    male     2  10   22
800    -27.876819   72.29    male     0  12   22
963    -25.655260   68.90    male     0  12   22
1105   988.565070   64.71  female     0  12   22
801   1000.221504   64.09  female     0  12   22
862   1002.023843   66.59  female     0  12   22
933   1007.994941   68.26  female     0  12   22
988   1578.542814   64.53    male     0  12   22
522   1955.168187   69.87  female     3  12   22
765   2581.870402   64.79  female     0  12   22

## Correlation & Covariance
[참조](https://nbviewer.jupyter.org/github/gaussian37/Machine-Learning/blob/master/Basic%20Statistics/covariance%20and%20correlation%20coefficient.ipynb)
- 상관계수의 공분산을 구하는 함수
- corr, cov, corrwith

상관계수

$\rho_{X, Y} = \frac{cov(X, Y)}{\rho_{X} \rho_{Y}} = \frac{E[(X - \mu_{X})(X - \mu_{Y})]}{\rho_{X} \rho_{Y}}$

In [40]:
df["age"].corr(df["earn"])

0.07400349177836058

$ cov(X, Y) = E[(X - \mu_{X})(X - \mu_{Y})] $

In [41]:
df["age"].cov(df["earn"])

36523.6992104089

In [45]:
df.corr()

            earn    height      race        ed       age
earn    1.000000  0.291600 -0.063977  0.350374  0.074003
height  0.291600  1.000000 -0.045974  0.114047 -0.133727
race   -0.063977 -0.045974  1.000000 -0.049487 -0.056879
ed      0.350374  0.114047 -0.049487  1.000000 -0.129802
age     0.074003 -0.133727 -0.056879 -0.129802  1.000000

In [57]:
A = df.corr()
A[A == 1.0] = 0
A.abs().idxmax()

earn          ed
height      earn
race        earn
ed          earn
age       height
dtype: object

In [62]:
# 젊은 연령층의 나이와 소득 관계를 확인해 본다.
df["age"][(df["age"] < 45) & (df["age"] > 25)].corr(df["earn"])

0.21238097035942677

# 7. Groupby

- SQL groupby 명령어와 같음
- Split → Apply → Combine 과정을 거쳐서 연산함

In [70]:
import pandas as pd

# data from: 
data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)
df.head()

   Points  Rank    Team  Year
0     876     1  Riders  2014
1     789     2  Riders  2015
2     863     2  Devils  2014
3     673     3  Devils  2015
4     741     3   Kings  2014

Split : 어떤 열을 기준으로 데이터를 그룹화 한다.
ex) Team 열을 기준으로 데이터를 그룹화 하면 Rider 그룹 / Devils 그룹 / Kings 그룹으로 나눌 수 있다.

Apply : 또 다른 열의 값을 기준으로 연산을 할 수 있다.
ex) Team 열의 그룹들을 기준으로 Point 열의 점수들을 더할 수 있다.

Combine :  Apply 결과를 모두 가져와서 한 개의 Series로 만들 수 있다.

In [72]:
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

## Hierarchical index

- 두 개의 column으로 groupby를 할 경우, index가 두 개 생성됨

In [83]:
rst = df.groupby(["Team", "Year"])["Points"].sum()
rst

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [84]:
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [85]:
# 2 개의 Label을 이용하여 Hierarchical index가 만들어진 상태
rst.index

MultiIndex(levels=[['Devils', 'Kings', 'Riders', 'Royals'], [2014, 2015, 2016, 2017]],
           labels=[[0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3], [0, 1, 0, 1, 2, 3, 0, 1, 2, 3, 0, 1]],
           names=['Team', 'Year'])

### Hierarchical index - unstack()

- Group으로 묶여진 데이터를 matrix 형태로 전환해줌

In [87]:
rst

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [86]:
rst.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

### swaplevel 
- index level을 변경할 수 있음

In [88]:
rst.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2015  Kings     812
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
Name: Points, dtype: int64

In [92]:
rst.swaplevel().sortlevel()

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Kings     812
      Riders    789
      Royals    804
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

In [99]:
rst.sum(level = 0)

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Points, dtype: int64

In [100]:
rst.sum(level = 1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64